Тест/Тест/src/Catalogs/ДолжностиПредприятия/ДолжностиПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДолжностиПредприятия</name>
  <attributes>
    <name>СпособНачисленияОклада</name>
    <type>
      <types>EnumRef.СпособыНачисленияОклада</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНачисленияПремии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНачисленияСдельнойОплаты</name>
    <type>
      <types>EnumRef.СпособыНачисленияСдельнойОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильПоказателей</name>
    <type>
      <types>CatalogRef.ПрофилиПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычитатьНеявкиИзСдельнойОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкладДолжности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Обязанности</name>
    <attributes>
      <name>Обязанность</name>
      <type>
        <types>CatalogRef.Обязанности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Enums/СпособыНачисленияСдельнойОплаты/СпособыНачисленияСдельнойОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияСдельнойОплаты</name>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>ПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСПродажЗаВычетомОклада</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Catalogs/ДолжностиПредприятия/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не ЗначениеЗаполнено(СпособНачисленияОклада) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Календарь");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;	

	Если НЕ (СпособНачисленияСдельнойОплаты = ПредопределенноеЗначение("Перечисление.СпособыНачисленияСдельнойОплаты.ПроцентСПродаж")
		ИЛИ СпособНачисленияСдельнойОплаты = ПредопределенноеЗначение("Перечисление.СпособыНачисленияСдельнойОплаты.ПроцентСПродажЗаВычетомОклада")) Тогда
			
		ВычитатьНеявкиИзСдельнойОплаты = Ложь;
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
